using System;

//행동에 대해
// 1. 지형에서 움직인다.
// 2. 몬스터를 공격한다.
// NPC와 대화한다.
// 스킬을사용한다.
//이런것들을 표현하는것이 맴버함수라고 한다.
class Player
{
    // 명사만으로는 부족해
    int ATT;
    int HP;
    //행동으로 나타나게 된다.
    /*리턴값*/ void /*리턴값*/ Move/*인자값*/()
    {//<- 함수의 시작

    }// <- 함수의 끝

    void Fight()
    {
    }
    void SkillUse()
    {
    }
    void Talk()
    {
    }
    /*
     RPG를 만든다 -> 프로젝트를 만든다.
    주인공이 있다 -> 클래스
    주인공이 공격력이 있다 -> 맴버변수
    주인공이 공격력으로 때린다 -> 맴버함수
     */
}